import { Component } from '@angular/core';

interface EventItem {
  status?: string;
  date?: string;
  icon?: string;
  color?: string;
  image?: string;
}

@Component({
  selector: 'app-reward',
  templateUrl: './reward.component.html',
  styleUrls: ['./reward.component.scss']
})
export class RewardComponent {

  listRewards: any[] = [
    {
      id: 1,
      title: 'บริจาคเลือดครบ 1 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก นอกจากนี้คุณจะได้รับค่าช่วยเหลือของค่าห้องและค่าอาหารพิเศษ โดยจะให้เบิกตามสิทธิที่เบิกได้ก่อน ส่วนที่เกินจากสิทธิให้จ่ายเพียง 50% ในโรงพยาบาลในสังกัดกระทรวงสาธารณสุข',
      state: 1,
    },
    {
      id: 2,
      title: 'บริจาคเลือดครบ 7 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก นอกจากนี้คุณจะจ่ายค่ารักษาพยาบาลประเภทผู้ป่วยสามัญ โดยไม่รวมค่ายาและเวชภัณฑ์ต่าง ๆ กรณีที่อยู่ห้องพิเศษ ผ่าตัด ผ่าตัดคลอดบุตร เสียค่าใช้จ่าย 50% ในโรงพยาบาลในสังกัดสภากาชาดไทย',
      state: 1,
    },
    {
      id: 3,
      title: 'บริจาคเลือดครบ 16 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก',
      state: 0,
    },
    {
      id: 3,
      title: 'บริจาคเลือดครบ 18 ครั้ง',
      description: 'คุณจะได้รับค่าช่วยเหลือของค่าห้องและค่าอาหารพิเศษ 50% ของอัตราที่กำหนดไว้ ในโรงพยาบาลในสังกัดกระทรวงสาธารณสุข',
      state: 0,
    },
    {
      id: 4,
      title: 'บริจาคเลือดครบ 24 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก นอกจากนี้ฟรีค่ารักษาพยาบาลประเภทผู้ป่วยสามัญ โดยไม่รวมค่ายาและเวชภัณฑ์ต่าง ๆ กรณีที่อยู่ห้องพิเศษ ผ่าตัด ผ่าตัดคลอดบุตร เสียค่าใช้จ่าย 50% ในโรงพยาบาลในสังกัดสภากาชาดไทย',
      state: 0,
    },
    {
      id: 5,
      title: 'บริจาคเลือดครบ 36 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก ',
      state: 0,
    },
    {
      id: 6,
      title: 'บริจาคเลือดครบ 48 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก ',
      state: 0,
    },
    {
      id: 7,
      title: 'บริจาคเลือดครบ 50 ครั้ง',
      description: 'ได้รับพระราชทานเหรียญกาชาดสมนาคุณชั้น 3 พร้อมใบประกาศกำกับเหรียญกาชาดสมนาคุณ ',
      state: 0,
    },
    {
      id: 8,
      title: 'บริจาคเลือดครบ 60 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก',
      state: 0,
    },
    {
      id: 9,
      title: 'บริจาคเลือดครบ 72 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก',
      state: 0,
    },
    {
      id: 10,
      title: 'บริจาคเลือดครบ 75 ครั้ง',
      description: 'ได้รับพระราชทานเหรียญกาชาดสมนาคุณชั้น 2 พร้อมใบประกาศกำกับเหรียญกาชาดสมนาคุณ ',
      state: 0,
    },
    {
      id: 11,
      title: 'บริจาคเลือดครบ 84 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก',
      state: 0,
    },
    {
      id: 12,
      title: 'บริจาคเลือดครบ 96 ครั้ง',
      description: 'ผู้บริจาคจะได้รับเข็มกลัดที่ระลึก',
      state: 0,
    },
    {
      id: 13,
      title: 'บริจาคเลือดครบ 108 ครั้ง',
      description: 'ได้รับพระราชทานเหรียญกาชาดสมนาคุณชั้น 1 พร้อมใบประกาศกำกับเหรียญกาชาดสมนาคุณ ',
      state: 0,
    },
  ];

}
